@extends('layouts.admin')

@section ('admincontent')

<ol class="breadcrumb">
  <li class="active">หน้าหลัก</li>
  @if(Auth::getUser()->grp_id == 1)
  <li class="active"><a href="{{URL::route('policy')}}">นโยบายคลังฯ</a></li>
  @else
  <li class="active"><a href="{{URL::route('admin')}}">นโยบายคลังฯ</a></li>
  @endif
  <li class="active">พีบีดีพีไอเอ</li>
</ol>

<div class="panel panel-default">
  <!-- Default panel contents -->
  <div class="panel-heading">แผงตัวอย่างแนวปฏิบัติพีบีดีพีไอเอที่เลือกใช้เหมาะสมกับนโยบายองค์กร </div>
  <div class="panel-body">
    <p></p>
  </div>
  <input type="hidden" id="policy_id" name="policy_id" value="{{$policy_id}}">
  <!-- Table -->
  <table id="result_search_policy" class="table table-hover table-bordered">
    <thead>
      <tr class="active">
        <th class="text-center">หลักการพีบีดี</th>
        <th class="text-center">คำถามพีบีดีพีไอเอที่เลือก</th>
        <th class="text-center">เหตุผลที่เลือก</th>
      </tr>
    </thead>
    <tbody >
          <tr id="policy_num1">
            <td class="text-left col-md-4">
              1) การป้องกันและคาดการณ์ก่อนที่จะเกิดการรุกรานด้าน<br/>ไพเวซี
            </td>
            <td class="text-left col-md-4">
              1) มีบุคคลที่ได้รับมอบหมายให้ทำหน้าที่รับผิดชอบในการพัฒนา บำรุงรักษา ละดำเนินการในเรื่องสารสนเทศด้าน<br/>ไพรเวซีขององค์กร และการปกป้องข้อมูลหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อให้คลังสารสนเทศกลางสามารถกำหนดผู้ที่ทำหน้าที่รับผิดชอบด้านการบำรุงรักษา และปกป้องข้อมูลขององค์กร
            </td>
          </tr>

          <tr id="policy_num2">
            <td class="text-left col-md-4">
            </td>
            <td class="text-left col-md-4">
              2) ผู้ที่เกี่ยวข้องที่ถึงข้อมูลจะต้องมีการอบรมตามบทบาทเพื่อให้เกิดความเข้าใจไพรเวซีข้อมูลความปลอดภัยและขั้นตอนการทำงานเพื่อนำไปปฏิบัติอย่างถูกต้องหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อให้ผู้เกี่ยวที่ข้องกับคลังสารสนเทศกลางได้ทราบถึงขั้นตอนการทำงานและเข้าใจถึงบทบาทผู้ใช้งานในคลังสารสนเทศกลาง
            </td>
          </tr>

          <tr id="policy_num3">
            <td class="text-left col-md-4">
            2) ไพรเวซีจะได้รับการปกป้องตั้งแต่เริ่มต้นใช้งานแม้ไม่มีการกำหนดโดยผู้ใช้งาน
            </td>
            <td class="text-left col-md-4">
              1) มีการดำเนินการควบคุมการเข้าถึงข้อมูลบนพื้นฐานของการ ‘ระบุตัวตน’ และ ‘สิทธิ์’ในการดำเนินการกับข้อมูลหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อให้แน่ใจว่าผู้ใช้ที่มีสิทธิ์เท่านั้นที่สามารถกระทำกับข้อมูลได้โดยเป็นไปตามไพรเวซีพื้นฐานที่ได้ถูกกำหนดไว้
            </td>
          </tr>

          <tr id="policy_num4">
            <td class="text-left col-md-4">
            3) ไพรเวซีได้ถูกฝังอยู่ในขั้นตอนการออกแบบสถาปัตยกรรมของระบบไอทีและการดำเนินกิจกรรมในองค์กร
            </td>
            <td class="text-left col-md-4">
              1) มีการบังคับให้มีการตั้งรหัสผ่านที่ยากต่อการคาดเดารวมไปถึงมีการกำหนดขนาดความยาวของรหัสผ่านหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อสร้างความมั่นใจให้กับผู้เกี่ยวที่ข้องคลังสารสนเทศกลางว่ารหัสผ่านที่ผู้ใช้กำหนดขึ้นใช้งานในยากต่อการคาดเดา
            </td>
          </tr>

          <tr id="policy_num5">
            <td class="text-left col-md-4">
            4) ให้ความสำคัญกับกฏระเบียบและวัตถุประสงค์โดยพิจารณาทั้งเรื่องไพรเวซีและความมั่นคง
            </td>
            <td class="text-left col-md-4">
              1) มีการวางโครงสร้างและกลไกสำหรับผู้ที่เกี่ยวข้องเพื่อตรวจสอบให้แน่ใจว่าไม่มีการแยกหน้าที่การทำงานด้านไพรเวซีและความมั่นคงออกจากกันหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อสร้างความมั่นใจและความน่าเชื่อถือให้กับผู้ที่เกี่ยวข้องคลังสารสนเทศกลาง
            </td>
          </tr>

          <tr id="policy_num6">
            <td class="text-left col-md-4">
            5) ไพรเวซีได้ถูกฝังอยู่ระบบตั้งแต่เริ่มกิจกรรมจนสิ้นสุดกิจกรรมของข้อมูล
            </td>
            <td class="text-left col-md-4">
              1) ได้มีการสร้างตารางเวลาในการเก็บรักษาข้อมูลการทำลายข้อมูลด้านไพรเวซีที่ปลอดภัยหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่อแสดงให้กับผู้ที่เกี่ยวข้องกับคลังสารสนเทศกลางได้รับทราบช่วงเวลาของการจัดเก็บทำลาย ข้อมูลด้านไพรเวซี
            </td>
          </tr>

          <tr id="policy_num7">
            <td class="text-left col-md-4">
            6) ความโปร่งในใสการดำเนินกิจกรรมด้านไพรเวซีภายในองค์กรตามนโยบายที่ได้กำหนด
            </td>
            <td class="text-left col-md-4">
              1) ได้มีการกำหนดช่องทางเพื่อใช้ในการสื่อสารเจ้าหน้าที่ที่มีความรับผิดชอบด้านไพรเวซีและความมั่นคงมีการแจ้งให้ทราบโดยทั่วถึงทั้งองค์กรหรือไม่
            </td>
            <td class="text-left col-md-4">
              เพื่ออำนวยความสะดวกแก่ผู้เกี่ยวข้องกับคลังสารสนเทศกลาง
            </td>
          </tr>

          <tr id="policy_num8">
            <td class="text-left col-md-4">
            7) ผู้เกี่ยวข้องด้านไพรเวซีจะต้องสนับสนุนเพื่อให้ไพรเวซีเกิดประโยชน์สูงสุดต่อผู้ใช้งาน
            </td>
            <td class="text-left col-md-4">
              1) ทุกนโยบาย ขั้นตอนการปฏิบัติและข้อมูลจำเป็นต้องมีการแจ้งให้ผู้ใช้ทราบ โดยผ่านช่องทางที่ง่ายต่อการเข้าถึง และเขียนในรูปแบบภาษาที่ง่ายต่อการทำความเข้าใจหรือไม่
            </td>
            <td class="text-left col-md-4">
              เเพื่อสร้างความโปร่งใสในการปฏิบัติงานและการดำเนินงานของผู้เกี่ยวข้องคลังสารสนเทศกลาง
            </td>
          </tr>

    </tbody>
  </table>
</div>
@stop

@section('bodyjs')
@parent
  <script type="text/javascript">
  //$(document).ready(function(){
    var policy_id = $('#policy_id').val();
    $('#policy_num3').addClass('success');
    $('#policy_num5').addClass('success');
 // });
  </script>
@stop
