@extends('layouts.admin')
@section ('admincontent')

@section('head')
    @parent
    <style>
        .boderImg {
          border: 1px #e4e4e4 solid;
        }
    </style>
@stop

 <!-- http://www.webtipblog.com/adding-scroll-top-button-website/ -->
 <div class="scroll-top-wrapper ">
    <span class="scroll-top-inner">
        <i class="icon-circle-arrow-up icon-5"></i>
    </span>
</div>

<ol class="breadcrumb">
  <li><a href="{{ URL::to('admin') }}">หน้าหลัก</a></li>
  <li class="active">ช่วยเหลือ</li>
</ol>
<div class="col-lg-12">

            
            <div class="panel panel-default">
                <!-- Default panel contents -->
                <div class="panel-heading">แผงการใช้งานระบบ</div>
                <div class="panel-body">
                 @if(Auth::getUser()->grp_id == 1)
                  <p>ขั้นตอนการใช้งานระบบ</p>
                    <p>แนะนำการใช้งานระบบสำหรับผู้ดูแลระบบ</p>
                    <ol>
                      
                      <li>นโยบายคลังสารสนเทศกลางฯ</li>
                        <ol>
                          <li><a href="#savePolicy">บันทึกนโยบายที่ได้รับจากผู้บริหารในระบบ</a></li>
                          <li><a href="#editPolicy">แก้ไขรายการนโยบาย</a></li>
                          <li><a href="#delPolicy">ลบรายการนโยบาย</a></li>
                          <li><a href="#PBDIAPolicy">แสดงรายการพีบีดีไอเอที่เกี่ยวข้องกับนโยบาย</a></li>
                          <li><a href="#RBAC">การแยกเอนทีตีนโยบายตามหลักการของพีอาร์บีเอซี</a></li>
                        </ol>

                      <li>พีอาร์บีเอซี</li>
                        <ol>
                          <li><a href="#mngRBAC">แสดงรายการเอนทีตีและการเพิ่มเอนทิตี</a></li>
                          <li><a href="#editRBAC">การแก้ไขและลบเอนทิตี</a></li>
                        </ol>

                      <li>ผู้ใช้และหน่วยงาน</li>
                      <ol>
                          <li><a href="#approveUser">การเปลี่ยนประเภทผู้ใช้งานและการอนุญาตให้ผู้ใช้งานใช้งานระบบ</a></li>
                          <li><a href="#approveUser">การมอบหมายบทบาทให้กับผู้ใช้งาน</a></li>
                          <li><a href="#responsibilityPolicy">การแสดงรายการและเพิ่มผู้รับผิดชอนนโยบาย</a></li>
                          <li><a href="#editResponsibilityPolicy">การแกไ้ขและลบผู้รับผิดชอนนโยบาย</a></li>
                          <li><a href="#Org">การแสดงและเพิ่มหน่วยงานที่ให้ความร่วมมือกับคลังสารสนเทศฯ</a></li>
                        </ol>

                      <li>การค้นหา</li>
                        <ol>
                          <li><a href="#searchByRole">การค้นหาผู้ใช้งานตามบทบาท</a></li>
                          <li><a href="#searchByData">การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</a></li>
                          <li><a href="#searchByOrg">การหาข้อมูลตามหน่วยงาน</a></li>
                        </ol>

                      <li>สถิติและรายงาน</li>
                        <ol>
                          <li><a href="#rePort">สถิติการใช้งาน</a></li>
                          <li><a href="#rePort">รายงานการใช้ระบบ</a></li>
                        </ol>

                      <li>หลักสูตรอบรม</li>
                        <ol>
                          <li><a href="#Train">การจัดการหลักสูตรอบรม</a></li>
                          <li>การออกรายงานหลักสูตรอบรม</li>
                          <ol>
                            <li><a href="#trainReport">รายงานรายบุคคล</a></li>
                            <li><a href="#trainReport">รายงานตามบทบาท</a></li>
                            <li><a href="#trainReport">รายงานตามช่วงเวลา</a></li>
                            <li><a href="#trainReport">รายงานตามชื่อหลักสูตร</a></li>
                          </ol>
                        </ol>

                      <li>การตั้งค่าไพรเวซีและข้อมูลบัญชี</li>
                        <ol>
                          <li><a href="#Privacy">การตั้งค่าไพรเวซีของผูใ้ช้งาน</a></li>
                          <li><a href="#UserPrivacy">การตั้งค่าไพรเวซีเริ่มต้นของผู้ใช้งานในระบบ</a></li>
                          <li><a href="#RetainData">การกำหนดระยะเวลาการเก็บรักษาข้อมูล</a></li>
                          <li><a href="#Account">การแสดงข้อมูลบัญชีและการแก้ไข</a></li>
                        </ol>
                      
                      <li>การตั้งค้าความมั่นคง</li>
                        <ol>
                          <li><a href="#ChangePasswd">การเปลี่ยนรหัสผ่าน</a></li>
                          <li><a href="#TestPasswd">การวัดความเข้มแข็งของรหัสผ่าน</a></li>
                          <li><a href="#SugguestPwd">การแนะนำการสร้างรหัสผ่าน</a></li>
                          <li><a href="#ToolPwd">เครื่องมือช่วยสร้างรหัสผ่าน</a></li>
                        </ol>                      

                      <li><a href="{{URL::to('pbdia')}}">แสดงตารางพีบีดีไอเอ</a></li>

                    </ol>
                  
                @else
                  <p>ขั้นตอนการใช้งานระบบ</p>
                  <!-- <p>แนะนำการใช้งานระบบ</p> -->
                  
                  <ol>
                    <li>การค้นหา</li>
                          <ol>
                            <li><a href="#searchByRole">การค้นหาผู้ใช้งานตามบทบาท</a></li>
                            <li><a href="#searchByData">การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</a></li>
                            <li><a href="#searchByOrg">การหาข้อมูลตามหน่วยงาน</a></li>
                          </ol>

                    <li><a href="#getData">การเรียกดูข้อมูล</a></li>
                    <li>การร้องขอข้อมูล</li>
                      <ol>
                        <li><a href="#requestData">การส่งคำร้องขอ</a></li>
                        <li><a href="#approveReqData">การอนุมัติคำร้อง</a></li>
                      </ol>

                   <li>การตั้งค่าไพรเวซีและข้อมูลบัญชี</li>
                    <ol>
                      <li><a href="#Privacy">การตั้งค่าไพรเวซีของผูใ้ช้งาน</a></li>
                      <li><a href="#UserPrivacy">การตั้งค่าไพรเวซีเริ่มต้นของผู้ใช้งานในระบบ</a></li>
                      <li><a href="#RetainData">การกำหนดระยะเวลาการเก็บรักษาข้อมูล</a></li>
                      <li><a href="#Account">การแสดงข้อมูลบัญชีและการแก้ไข</a></li>
                    </ol>
                  
                  <li>การตั้งค้าความมั่นคง</li>
                    <ol>
                      <li><a href="#ChangePasswd">การเปลี่ยนรหัสผ่าน</a></li>
                      <li><a href="#TestPasswd">การวัดความเข้มแข็งของรหัสผ่าน</a></li>
                      <li><a href="#SugguestPwd">การแนะนำการสร้างรหัสผ่าน</a></li>
                      <li><a href="#ToolPwd">เครื่องมือช่วยสร้างรหัสผ่าน</a></li>
                    </ol>  

                  </ol>

                <h3 id="searchByRole" class="page-header">1.1 การค้นหาผู้ใช้งานตามบทบาท</h3>
                <p>สำหรับการค้นหาผู้ใช้งานในระบบตามบทบาทเจ้าหน้าค้นหาโดยเลือกที่เมนูค้นหา ดังแสดงในรูปที่ 1 ค้นหาตามบาท ผลลัพธ์การค้นหาแสดงดังรูปที่ 2 และสามารถกดเพื่อดูข้อมูลผู้ใช้นั้นได้</p>
                <div class="row">
                    <div class="col-md-12">

                        <img src="{{URL::asset('images/new_admin/4.เมนูการค้นหา.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 1.แสดงเมนูการค้นหา</h4>
                        <br /> 
                        <img src="{{URL::asset('images/new_admin/4.1ค้นหาตามบทบาท.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 2.แสดงรายการการค้นหาตามบทบาท</h4>
                        
                    </div>
                </div>
                                
                <h3 id="searchByData" class="page-header">1.2 การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</h3>
                <p>เป็นการค้นหาข้อมูลว่าหน่วยงานไหนที่ส่งข้อมูลนั้นเข้าคลังสารสนเทศบ้าง ดังแสดงในรูปที่ 3</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/4.2ค้นหาตามข้อมูลที่ให้.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 3.แสดงรายการค้นหาหน่วยงานตามข้อมูล</h4>
                        
                    </div>
                </div>

                <h3 id="searchByOrg" class="page-header">1.3 การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</h3>
                <p>สำหรับการค้นหาหน่วยงานที่ให้ความร่วมมือกับคลังสารสนเทศ จะแสดงข้อมูลที่หน่วยงานนั้นๆ นำเข้าคลังสาร และสถานะข้อมูลว่าพร้อมให้บริการต่อทุกหน่วยงานพันธมิตรหรือไม่ดังแสดงในรูปที่ 4</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/4.3ค้นหาตามหน่วยงาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 4.แสดงรายการข้อมูลตามหน่วยงานที่ส่งมาให้คลังสารสนเทศกลาง</h4>
                        
                    </div>
                </div>

                <h3 id="getData" class="page-header">2. การเรียกดูข้อมูล</h3>
                <p>เมื่อผู้ใช้วานเข้าสู่ระบบและต้องการเรียนดูข้อมุล สามารถระบุข้อมูล หน่วยงาน เงื่อนไข ข้อมูลที่ต้องการเรียกดู ดังแสดงในรูปที่ 5</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_user/2การเรียกดูข้อมู.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 5.แสดงรายการข้อมูลตามเงื่อนไขที่ผู้ใช้งานระบุ</h4>
                        
                    </div>
                </div>
                
                <h3 id="requestData" class="page-header">3.1 การส่งคำร้องขอ</h3>
                <p>ในการร้องข้อข้อมูลผู้ใช้งานจะต้องระบุข้อมูล หน่วยงานข้อมูล และวัตถุประสงค์การร้องขอดังแสดงอยู่ในรูปที่ 6</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_user/3การร้องขอข้อมูล.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 6.แสดงหน้าการร้องขอข้อมูล</h4>
                    </div>
                </div>

                <h3 id="approveReqData" class="page-header">3.1 การอนุมัติคำร้อง</h3>
                <p>การตอบรับหรือปฏิเสธคำร้องขอมูล โดยพิจารณาจากคำร้องขอ ซึ่งจะแสดงข้อมูลหน่วยงาน วันที่ร้องขอ วัตถุประสงค์ของการขอข้อมูล ดังแสดงอยู่ในรูปที่ 7</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_user/3.2การอนุมัติคำร้อง.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 7.แสดงหน้าการพิจารณาคำร้องขอข้อมูล</h4>
                    </div>
                </div>

                <h3 id="Privacy" class="page-header">4.1 การตั้งค่าไพรเวซีของผูใ้ช้งาน</h3>
                <p>เมนูการตั้งค่าไพรเวซี ความมั่นคง หรือการแก้ไขข้อมูลผู้ใช้งาน แสดงในรูปที่ 8 ตัวอย่างของการกำหนดไพเวซีของแต่ละบุคคแสดงอยู่ในรูปที่ 9</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.การตั้งค่าไพรเวซีและข้อมูลบัญชี.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 8.เมนูการตั้งค่า</h4>
                        <br/>
                        <img src="{{URL::asset('images/new_admin/7.1การตั้งค่าไพรเวซีของผูใ้ช้งาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 9.แสดงตัวอย่างการตั้งค่าไพรเวซี</h4>
                    </div>
                </div>

                <h3 id="UserPrivacy" class="page-header">4.2 การตั้งค่าไพรเวซีเริ่มต้นของผู้ใช้งานในระบบ</h3>
                <p>สำหรับการตั้งค่าไพรเวซีเริ่มต้นสำหรับผู้ใช้งานในระบบ ซึ่งจะเป็นการกำหนดค่าเริ่มต้นเมื่อผู้ใช้งานลงทะเบียนใช้งานระบบ แสดงอยู่ในรูปที่ 10</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/6.2การออกรายงานหลักสูตรอบรม.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 10.แสดงตัวอย่างการกำหนดไพรเวซีเริ่มต้นสำหรับผู้ใชังาน</h4>
                        
                    </div>
                </div>

                <h3 id="RetainData" class="page-header">4.3 การกำหนดระยะเวลาการเก็บรักษาข้อมูล</h3>
                <p>การกำหนดระยะเวลาการเก็บข้อมูลนั้นทำได้โดยเลือกข้อมูลและกำหนดระยะเวลาการเก็บรักษาดังแสดงอยู่ในรูปที่ 11</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.3การกำหนดระยะเวลาการเก็บรักษาข้อมูล.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 11.แสดงตัวอย่างการกำหนดไพรเวซีเริ่มต้นสำหรับผู้ใชังาน</h4>
                        
                    </div>
                </div>

                <h3 id="Account" class="page-header">4.4 การแสดงข้อมูลบัญชีและการแก้ไข</h3>
                <p>สำหรับการแสดงข้อมูลบัญชีของผู้ใช้งานและแก้ไขข้อมูลดังแสดงอยู่ในรูปที่ 12</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.4การแสดงข้อมูลบัญชีและการแก้ไข.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 12.แสดงตัวอย่างการแสดงข้อมูลบัญชีและการแก้ไข</h4>
                        
                    </div>
                </div>

                <h3 id="ChangePasswd" class="page-header">5.1 การเปลี่ยนรหัสผ่าน</h3>
                <p>การเปลี่ยนระหรัสผ่านของผู้ใช้งานสามารถทำได้ดังแสดงอยู่ในรูปที่ 13</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.1การเปลี่ยนรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 13.แสดงตัวอย่างการเปลี่ยนรหัสผ่าน</h4>
                        
                    </div>
                </div>

                <h3 id="TestPasswd" class="page-header">5.2 การวัดความเข้มแข็งของรหัสผ่าน</h3>
                <p>การวัดความเข้มแข็งของรหัสผ่านนั้นจะช่วยให้ผู้ใช้งานได้ทราบว่ารหัสที่ใช้งานอยู่นั้นมีความยากง่ายต่อการคาดเดาหรอืไม่ ดังแสดงอยู่ในรูปที่ 14</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.2การวัดความเข้มแข็งของรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 14.แสดงตัวอย่างการทดสอบความเข้มแข็งของรหัสผ่าน</h4>
                        
                    </div>
                </div>
                
                <h3 id="SugguestPwd" class="page-header">5.3 การแนะนำการสร้างรหัสผ่าน</h3>
                <p>เป็นข้อแนะนำสำหรับการสร้างหรัสผ่านที่เข้มแข็ง ดังแสดงอยู่ในรูปที่ 15</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.3การแนะนำการสร้างรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 15.แสดงข้อแนะนำสำหรับการสร้างรหัสผ่านที่เข้มแข็ง</h4>
                        
                    </div>
                </div>

                <h3 id="ToolPwd" class="page-header">5.4 เครื่องมือช่วยสร้างรหัสผ่าน</h3>
                <p>เครื่องมือที่ช่วยให้ผู้ใช้งานสามารถสร้างรหัสผ่านที่จดจำได้ง่าย ผู้ใช้สามารถกำหนดคำที่จดจำได้ง่าน 2 คำเพื่อสร้างเป็นรหัสผ่าน ดังแสดงอยู่ในรูปที่ 16</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.4เครื่องมือช่วยสร้างรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 16.แสดงตัวอย่างเครื่องมือในการสร้างรหัสผ่าน</h4>
                        
                    </div>
                </div>

                @endif
                </div>
                
                @if(Auth::getUser()->grp_id == 1)
                <h3 id="savePolicy" class="page-header">1.1 บันทึกนโยบายที่ได้รับจากผู้บริหารในระบบ</h3>
                <p>สำหรับการบันทึกนโยบายสามารถทำได้เมื่อเจ้าหน้าที่คลังสารสนเทศเข้าสู่ระบบ และกดปุ่มเพิ่มนโยบายก็จะปรากฏดังรูปด้านล่างนี้ เนื้อหานโยบายก็คือนโยบายการใช้งาน และเจ้าหน้าคลังสารสนเทศจำเป็นต้องระบุผู้รับผิดชอบนโยบาย รวมไปถึงกำหนดสถานะนโยบายนั้นว่าต้องการเปิดใช้งานหรือไม่</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/1.1หน้าบันทึกนโยบาย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 1.แสดงแบบฟอร์มกรอกนโยบาย</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/1.1.1บันทึกนโยบายสำเร็จ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 2.แสดงข้อความเมื่อบันทึกสำเร็จ</h4>
                        
                    </div>
                </div>

                <h3 id="editPolicy" class="page-header">1.2 แก้ไขรายการนโยบาย</h3>
                <p>สำหรับการแก้ไขนโยบายสามารถทำได้เมื่อเจ้าหน้าที่คลังสารสนเทศเข้าสู่ระบบ และกดปุ่มแก้ไขนโยบายก็จะปรากฏดังรูปด้านล่างนี้ โดยสามารถแก้ไขเนื้อหานโยบายก็คือนโยบายการใช้งาน ผู้รับผิดชอบนโยบาย รวมไปถึงกำหนดสถานะนโยบายนั้นว่าต้องการเปิดใช้งานหรือไม่</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/1.2หน้าแก้ไขนโยบาย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 3.แสดงแบบฟอร์มการแก้ไขนโยบาย</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/1.2.1แก้ไขนโยบายสำเร็จ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 4.แสดงข้อความเมื่อแก้ไขนโยบายสำเร็จ</h4>
                    </div>
                </div>

                <h3 id="delPolicy" class="page-header">1.3 ลบรายการนโยบาย</h3>
                <p>การยกเลิกหรือการลบนโยบายนั้นจะต้องได้รับความเห็นชอบจากผู้บริหาร เจ้าหน้าที่คลังสารสนเทศเป็นเพียงแต่ผู้ปฏิบัติงานแทนเท่านั้น</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/1.3หน้าลบทิ้งนโยบาย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 4.แสดงแบบฟอร์มการลบนโยบาย</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/1.3.1ลบทิ้งนโยบายสำเร็จ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 5.แสดงข้อความเมื่อลบนโยบายสำเร็จ</h4>
                    </div>
                </div>

                <h3 id="PBDIAPolicy" class="page-header">1.4 แสดงรายการพีบีดีไอเอที่เกี่ยวข้องกับนโยบาย</h3>
                <p>เมื่ออยูนในหน้าแสดงรายการนโยบายดังแสดงด้านล่างนี้ และเมื่อกดปุ่มพีบีดีไอเอ จะปรากฏดังรูปที่ 7</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/1.4หน้าก่อนจะกดพีบีดีไอเอ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 6.แสดงรายการนโยบาย</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/1.4.1แสดงหน้าพีบีดีไอเอที่เกี่ยวข้อง.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 7.แสดงรายกงานพีบีดีไอเอ</h4>
                    </div>
                </div>

                <h3 id="RBAC" class="page-header">1.5 การแยกเอนทีตีนโยบายตามหลักการของพีอาร์บีเอซี</h3>
                <p>สำหรับการแยกแอนทิตินโยบาย เมื่อเจ้านห้าที่คลังอยู่ในหน้าแสดงรายการนโยบายและกดเปุ่ม พีอาร์บีเอซี จะแสดงดังรูปด้านล่างนี้ เพื่อทำการแยกนโยบายและบันทึกเก็บต่อไป</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/1.5หน้าแยกเอนทีตี.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 8.แสดงรายการสำหรับแยกเอนทิตีนโยบาย</h4>
                    </div>
                </div>

                <h3 id="mngRBAC" class="page-header">2.1 แสดงรายการเอนทีตีและการเพิ่มเอนทิตี</h3>
                <p>ในรูปที่ 9 แสดงให้เห็นถึงเอนทิตีที่กับใช้กับนโยบายคลังสารสนเทศกลาง โดยเมื่อกดเลือกเมนูเอนทิตี้แล้วจะแสดงรายกงานาดังรูปที่ 10 โดยเจ้าหน้าที่คลังสารสนเทศกลางสามารถเลือก เพิ่ม ลบ ปรับปรุงแก้ไข ได้</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/2.1หน้าพีเอบีเอซี.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 9.แสดงเมนูจัดการเอนทิตี</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/2.1.1แสดงรายการพีอาร์บีเอซี.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 10.แสดงรายการเอนทิตีตามที่เลือก</h4>
                    </div>
                </div>

                <h3 id="editRBAC" class="page-header">2.2 การแก้ไขและลบเอนทิตี</h3>
                <p>การแก้ไขและลบเอนทิตีทำได้ เมื่อเจ้าหน้าที่คลังสารสนเทศอยู่ในหน้าแสดงรายการเอนทิตี ดังแสดงในรูปที่ 10 เพื่อเลือกว่าจะทำการแก้ไข หรือลบเอนทิตี เมื่อทำการแก้ไขหรือลำสำเร็จจะปรากฏดังรูปที่ 11</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/2.2หน้าลบทิ้งและแก้ไขสำเร็จ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 11.แสดงข้อความหลังจากแก้ไข หรือลบเอนทิตี</h4>
                        
                    </div>
                </div>
                

                <h3 id="approveUser" class="page-header">3.1 การเปลี่ยนประเภทผู้ใช้งานและการอนุญาตให้ผู้ใช้งานใช้งานระบบ</h3>
                <p>การเปลี่ยนประเภทผู้ใช้งานและการอนุญาตให้ใช้งานระบบ เจ้าหน้าที่คลังสารสนเทศจะต้องเข่าเมนู ผู้ใช้งานในระบบ ดังแสดงในรูปที่ 12 ซึ่งเมื่อเข้าไปแล้วจะแสดงดังรูปที่ 13 โดยจะแสดงรายการผู้ใช้งานในระบบทั้งหมด เมื่อเจ้าหน้าที่กดที่ปุ่มแก้ไข จะแสดงหน้าดังรูปที่ 14 ซึ่งเจ้าหน้าที่สามารถแก้ไข ประเภทผู้ใช้งานว่าจะให้เป็นผู้ดูแลระบบประจำหน่วยงานนั้น้ หรือแก้ไขสถานะการใช้งาน เป็นต้น</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/3.1หน้าเมนูผู้ใช้งาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 12.แสดงเมนูจัดการผู้ใช้งานในระบบ</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/3.1.1หน้าแสดงรายชื่อผู้ใช้งาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 13.แสดงรายกผู้ใช้งานในระบบทั้งหมด</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/3.1.2เปลี่ยนสถานะและประเภทผู้ใช้งาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 14.แสดงหน้าการแก้ไขประเภทผู้ใช้งาน มอบหมายบทบาท และปรับเปลี่ยนสถานะผู้ใช้</h4>
                    </div>
                </div>

                <h3 id="responsibilityPolicy" class="page-header">3.3 การแสดงรายการและเพิ่มผู้รับผิดชอนนโยบาย</h3>
                <p>ในรูปที่ 15 แสดงหน้ารายการของผู้รับผิดชอบนโยบายทั้งหมดซึ่งจะแสดงรายละเอียดเช่น สถานะ ข้อมูลสำหรับติดต่อ และในรูปที่ 16 แสดงให้เห็นถึงการเพิ่มผู้รับผิดนโยบาย</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/3.3.1แสดงรายชื่อผู้รับผิดชอบนโยบาย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 15.แสดงรายการผู้รับผิดชอบนโยบายในระบบ</h4>
                        <br />  
                        <img src="{{URL::asset('images/new_admin/3.3.1เพิ่มผู้รับผิดชอบนโยบย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 16.แสดงการเพิ่มผู้รับผิดชอบนโยบายในระบบ</h4>
                    </div>
                </div>

                
                <h3 id="editResponsibilityPolicy" class="page-header">3.4 การแกไ้ขและลบผู้รับผิดชอนนโยบาย</h3>
                <p>สำหรบการแก้ไขข้อมูลผู้รับผิดชอบนโยบาย สามารถทำได้โดยกดที่ปุ่มแก้ไขในหน้าแสดงรายการผู้รับผิดชอบนโยบาย</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/3.4แก้ไขผู้รับผิดชอบนโยบาย.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 17.แสดงหน้าสำหรับแกขไข้ข้อมูลผู้รับผิดชอบนโยบาย</h4>
                        
                    </div>
                </div>

                <h3 id="Org" class="page-header">3.5 การแสดงและเพิ่มหน่วยงานที่ให้ความร่วมมือกับคลังสารสนเทศฯ</h3>
                <p>ในเมนูนี้จะแสดงรายชื่อหน่วยงานที่ให้ความร่วมมือในการให้ข้อมูลกับคลังสารสนเทศกลาง โดยเจ้าหน้าที่สามารถเพิ่ม หรือลบรายการหน่วยงานในคลังสารสนเทศได้</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/3.5หน่วยงานที่ให้ความร่วมมือ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 18.แสดงรายชื่อหน่วยงานที่ให้ความร่วมมือกับคลังสารสนเทศกลาง</h4>
                        
                    </div>
                </div>

                <h3 id="searchByRole" class="page-header">4.1 การค้นหาผู้ใช้งานตามบทบาท</h3>
                <p>สำหรับการค้นหาผู้ใช้งานในระบบตามบทบาทเจ้าหน้าค้นหาโดยเลือกที่เมนูค้นหา ดังแสดงในรูปที่ 19 ค้นหาตามบาท ผลลัพธ์การค้นหาแสดงดังรูปที่ 20 และสามารถกดเพื่อดูข้อมูลผู้ใช้นั้นได้</p>
                <div class="row">
                    <div class="col-md-12">

                        <img src="{{URL::asset('images/new_admin/4.เมนูการค้นหา.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 19.แสดงเมนูการค้นหา</h4>
                        <br /> 
                        <img src="{{URL::asset('images/new_admin/4.1ค้นหาตามบทบาท.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 20.แสดงรายการการค้นหาตามบทบาท</h4>
                        
                    </div>
                </div>
                                
                <h3 id="searchByData" class="page-header">4.2 การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</h3>
                <p>เป็นการค้นหาข้อมูลว่าหน่วยงานไหนที่ส่งข้อมูลนั้นเข้าคลังสารสนเทศบ้าง ดังแสดงในรูปที่ 21</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/4.2ค้นหาตามข้อมูลที่ให้.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 21.แสดงรายการค้นหาหน่วยงานตามข้อมูล</h4>
                        
                    </div>
                </div>

                <h3 id="searchByOrg" class="page-header">4.3 การค้นหาหน่วยงานตามข้อมูลที่ให้ความร่วมมือ</h3>
                <p>สำหรับการค้นหาหน่วยงานที่ให้ความร่วมมือกับคลังสารสนเทศ จะแสดงข้อมูลที่หน่วยงานนั้นๆ นำเข้าคลังสาร และสถานะข้อมูลว่าพร้อมให้บริการต่อทุกหน่วยงานพันธมิตรหรือไม่ดังแสดงในรูปที่ 22</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/4.3ค้นหาตามหน่วยงาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 22.แสดงรายการข้อมูลตามหน่วยงานที่ส่งมาให้คลังสารสนเทศกลาง</h4>
                        
                    </div>
                </div>

                 <h3 id="rePort" class="page-header">5.1 สถิติการใช้งาน</h3>
                <p>สถิติและรายงานเจ้าหน้าที่คลังสารสนเทศสามารถเข้าได้ดังรูปที่ 23 โดยมีให้เลือกสองเมนูคือเลือกว่าจะแสดงหน้ารายงาน ดังแสดงในรูปที่ 24 หรือจะแสดงสถิติเป็นกราฟว่าดังแสดงในรูปที่ 25</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/5.เมนูสถิติรายงาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 23.แสดงเมนูสถติรายงาน</h4>
                        <br/>
                        <img src="{{URL::asset('images/new_admin/5.2หน้ารายงาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 24.แสดงรายงาน</h4>
                        <br/>
                        <img src="{{URL::asset('images/new_admin/5.1หน้าแสดงสถิติ.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 25.แสดงสถติ</h4>
                        <br/>
                    </div>
                </div>
                
                <h3 id="Train" class="page-header">6.1 การจัดการหลักสูตรอบรม</h3>
                <p>สำหรับเมนูการจัดการหลักสูตรเมื่อเมื่อเจ้าหน้าที่คลังสารสนเทศเข้ามาจะปรากฏดังรูปที่ 26 และเมื่อต้องการเพิ่มหลักสูตรก็จะปรากฏหน้าต่างให้เพิ่มหลักสูตรอบรมดังแสดงในรูปที่ 27</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/6.หลักสูตรอบรม.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 26.แสดงรายการการจัดการหลักสูตรอบรม</h4>
                        <br/>
                        <img src="{{URL::asset('images/new_admin/6.1การจัดการหลักสูตรอบรม.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 27.แสดงหน้าต่างสำหรับเพิ่มหลักสูตรอบรม</h4>
                    </div>
                </div>
                
                <h3 id="trainReport" class="page-header">6.2 การออกรายงานหลักสูตรอบรม</h3>
                <p>สำหรับการออกรายงานการอบรมนั้นเจ้าหน้าที่คลังสารสนเทศสามารถเลือกประเภทรายงานได้ตามความเหมาะสมเช่น ออกรายงานตามรายบุคคล หลักสูตร ตามบทบาท หรือตามช่วงเวลา ดังแสดงในรูปทีี่ 28</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/6.2การออกรายงานหลักสูตรอบรม.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 28.แสดงตัวอย่างการออกรายงาน</h4>
                        
                    </div>
                </div>
                
                <h3 id="Privacy" class="page-header">7.1 การตั้งค่าไพรเวซีของผูใ้ช้งาน</h3>
                <p>เมนูการตั้งค่าไพรเวซี ความมั่นคง หรือการแก้ไขข้อมูลผู้ใช้งาน แสดงในรูปที่ 29 ตัวอย่างของการกำหนดไพเวซีของแต่ละบุคคแสดงอยู่ในรูปที่ 30</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.การตั้งค่าไพรเวซีและข้อมูลบัญชี.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 29.เมนูการตั้งค่า</h4>
                        <br/>
                        <img src="{{URL::asset('images/new_admin/7.1การตั้งค่าไพรเวซีของผูใ้ช้งาน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 30.แสดงตัวอย่างการตั้งค่าไพรเวซี</h4>
                    </div>
                </div>

                <h3 id="UserPrivacy" class="page-header">7.2 การตั้งค่าไพรเวซีเริ่มต้นของผู้ใช้งานในระบบ</h3>
                <p>สำหรับการตั้งค่าไพรเวซีเริ่มต้นสำหรับผู้ใช้งานในระบบ ซึ่งจะเป็นการกำหนดค่าเริ่มต้นเมื่อผู้ใช้งานลงทะเบียนใช้งานระบบ แสดงอยู่ในรูปที่ 31</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/6.2การออกรายงานหลักสูตรอบรม.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 31.แสดงตัวอย่างการกำหนดไพรเวซีเริ่มต้นสำหรับผู้ใชังาน</h4>
                        
                    </div>
                </div>

                <h3 id="RetainData" class="page-header">7.3 การกำหนดระยะเวลาการเก็บรักษาข้อมูล</h3>
                <p>การกำหนดระยะเวลาการเก็บข้อมูลนั้นทำได้โดยเลือกข้อมูลและกำหนดระยะเวลาการเก็บรักษาดังแสดงอยู่ในรูปที่ 32</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.3การกำหนดระยะเวลาการเก็บรักษาข้อมูล.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 32.แสดงตัวอย่างการกำหนดไพรเวซีเริ่มต้นสำหรับผู้ใชังาน</h4>
                        
                    </div>
                </div>

                <h3 id="Account" class="page-header">7.4 การแสดงข้อมูลบัญชีและการแก้ไข</h3>
                <p>สำหรับการแสดงข้อมูลบัญชีของผู้ใช้งานและแก้ไขข้อมูลดังแสดงอยู่ในรูปที่ 33</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/7.4การแสดงข้อมูลบัญชีและการแก้ไข.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 33.แสดงตัวอย่างการแสดงข้อมูลบัญชีและการแก้ไข</h4>
                        
                    </div>
                </div>

                <h3 id="ChangePasswd" class="page-header">8.1 การเปลี่ยนรหัสผ่าน</h3>
                <p>การเปลี่ยนระหรัสผ่านของผู้ใช้งานสามารถทำได้ดังแสดงอยู่ในรูปที่ 34</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.1การเปลี่ยนรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 34.แสดงตัวอย่างการเปลี่ยนรหัสผ่าน</h4>
                        
                    </div>
                </div>

                <h3 id="TestPasswd" class="page-header">8.2 การวัดความเข้มแข็งของรหัสผ่าน</h3>
                <p>การวัดความเข้มแข็งของรหัสผ่านนั้นจะช่วยให้ผู้ใช้งานได้ทราบว่ารหัสที่ใช้งานอยู่นั้นมีความยากง่ายต่อการคาดเดาหรอืไม่ ดังแสดงอยู่ในรูปที่ 35</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.2การวัดความเข้มแข็งของรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 35.แสดงตัวอย่างการทดสอบความเข้มแข็งของรหัสผ่าน</h4>
                        
                    </div>
                </div>
                
                <h3 id="SugguestPwd" class="page-header">8.3 การแนะนำการสร้างรหัสผ่าน</h3>
                <p>เป็นข้อแนะนำสำหรับการสร้างหรัสผ่านที่เข้มแข็ง ดังแสดงอยู่ในรูปที่ 36</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.3การแนะนำการสร้างรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 36.แสดงข้อแนะนำสำหรับการสร้างรหัสผ่านที่เข้มแข็ง</h4>
                        
                    </div>
                </div>

                <h3 id="ToolPwd" class="page-header">8.4 เครื่องมือช่วยสร้างรหัสผ่าน</h3>
                <p>เครื่องมือที่ช่วยให้ผู้ใช้งานสามารถสร้างรหัสผ่านที่จดจำได้ง่าย ผู้ใช้สามารถกำหนดคำที่จดจำได้ง่าน 2 คำเพื่อสร้างเป็นรหัสผ่าน ดังแสดงอยู่ในรูปที่ 38</p>
                <div class="row">
                    <div class="col-md-12">
                        <img src="{{URL::asset('images/new_admin/8.4เครื่องมือช่วยสร้างรหัสผ่าน.png')}}" class="col-md-12 boderImg">
                        <h4>รูปที่ 38.แสดงตัวอย่างเครื่องมือในการสร้างรหัสผ่าน</h4>
                        
                    </div>
                </div>

            @endif
          </div><!-- End panel-body -->              
          
        </div> <!-- End panel-default -->              
        
</div><!--/col-lg-12-->
@stop
